#include "_pch.h"
#include "ModelFav.h"
using namespace wh;
//---------------------------------------------------------------------------

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
ModelFav::ModelFav()
	//:mCls(std::make_shared_ptr<ICls64>)
{
	
}
//---------------------------------------------------------------------------
void wh::ModelFav::DoShowFavEditor(int64_t cid)
{
	sigShow();
}
//---------------------------------------------------------------------------
//virtual 
void ModelFav::UpdateTitle() //override;
{
	wxString title = wxString::Format(
		"Выберите атрибуты %s для отображения"
		, mCls->GetTitle() );
	sigUpdateTitle(title, mIco);
}
